Repository: THD-C/Frontend
Catalog: src/locales/messages.*.xlf
Languages: pl

# privacy-policy.performanceContract
source: <strong>For the performance of a contract:</strong> the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.
pl: <strong>Dla realizacji umowy:</strong> opracowanie, zgodność i realizacja umowy zakupu produktów, przedmiotów lub usług, które zakupiłeś, lub jakiejkolwiek innej umowy z nami za pośrednictwem Usługi.

# privacy-policy.contactYou
source: <strong>To contact You:</strong> To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.
pl: <strong>Aby skontaktować się z Tobą:</strong> Aby skontaktować się z Tobą za pomocą e-maila, rozmów telefonicznych, SMS-ów lub innych równoważnych form komunikacji elektronicznej, takich jak powiadomienia push z aplikacji mobilnej dotyczące aktualizacji lub komunikatów informacyjnych związanych z funkcjonalnościami, produktami lub zakontraktowanymi usługami, w tym aktualizacjami zabezpieczeń, gdy jest to konieczne lub rozsądne dla ich wdrożenia.

# privacy-policy.newsOffersInfo
source: <strong>To provide You</strong> with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.
pl: <strong>Aby dostarczyć Ci</strong> wiadomości, specjalne oferty i ogólne informacje o innych towarach, usługach i wydarzeniach, które oferujemy i które są podobne do tych, które już zakupiłeś lub o które pytałeś, chyba że zdecydowałeś się nie otrzymywać takich informacji.

# privacy-policy.manageRequests
source: <strong>To manage Your requests:</strong> To attend and manage Your requests to Us.
pl: <strong>Aby zarządzać Twoimi prośbami:</strong> Aby obsłużyć i zarządzać Twoimi prośbami skierowanymi do Nas.

# privacy-policy.businessTransfers
source: <strong>For business transfers:</strong> We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred.
pl: <strong>Na potrzeby transferów biznesowych:</strong> Możemy wykorzystać Twoje informacje do oceny lub przeprowadzenia fuzji, sprzedaży aktywów, restrukturyzacji, reorganizacji, rozwiązania lub innej sprzedaży lub transferu części lub całości Naszych aktywów, jako działającego przedsiębiorstwa lub jako części postępowania upadłościowego, likwidacyjnego lub podobnego postępowania, w którym Dane Osobowe przechowywane przez Nas o użytkownikach Naszych usług są wśród przenoszonych aktywów.

# privacy-policy.otherPurposes
source: <strong>For other purposes</strong>: We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.
pl: <strong>Dla innych celów</strong>: Możemy wykorzystać Twoje informacje do innych celów, takich jak analiza danych, identyfikowanie trendów użytkowania, określanie skuteczności naszych kampanii promocyjnych oraz ocena i poprawa naszych Usług, produktów, usług, marketingu i Twoich doświadczeń.

# privacy-policy.sharePersonalData
source: We may share Your personal information in the following situations:
pl: Możemy udostępniać Twoje dane osobowe w następujących sytuacjach:

# privacy-policy.shareWithServiceProviders
source: <strong>With Service Providers:</strong> We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.
pl: <strong>Z dostawcami usług:</strong> Możemy udostępniać Twoje dane osobowe dostawcom usług w celu monitorowania i analizy korzystania z naszych Usług, aby skontaktować się z Tobą.

# privacy-policy.shareForBusinessTransfers
source: <strong>For business transfers:</strong> We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company.
pl: <strong>Na potrzeby transferów biznesowych:</strong> Możemy udostępniać lub przekazywać Twoje dane osobowe w związku z, lub w trakcie negocjacji, jakiejkolwiek fuzji, sprzedaży aktywów Firmy, finansowania lub przejęcia całości lub części Naszego biznesu przez inną firmę.

# privacy-policy.shareWithAffiliates
source: <strong>With Affiliates:</strong> We may share Your information with Our affiliates, in which case we will require those affiliates to honor this Privacy Policy. Affiliates include Our parent company and any other subsidiaries, joint venture partners or other companies that We control or that are under common control with Us.
pl: <strong>Z podmiotami powiązanymi:</strong> Możemy udostępniać Twoje informacje naszym podmiotom powiązanym, w takim przypadku będziemy wymagać od tych podmiotów poszanowania niniejszej Polityki Prywatności. Podmioty powiązane obejmują naszą spółkę macierzystą i wszelkie inne spółki zależne, partnerów w joint venture lub inne firmy, które kontrolujemy lub które są pod wspólną kontrolą z Nami.

# privacy-policy.shareWithBusinessPartners
source: <strong>With business partners:</strong> We may share Your information with Our business partners to offer You certain products, services or promotions.
pl: <strong>Z partnerami biznesowymi:</strong> Możemy udostępniać Twoje informacje naszym partnerom biznesowym, aby zaoferować Ci określone produkty, usługi lub promocje.

# privacy-policy.shareWithOtherUsers
source: <strong>With other users:</strong> when You share personal information or otherwise interact in the public areas with other users, such information may be viewed by all users and may be publicly distributed outside. If You interact with other users or register through a Third-Party Social Media Service, Your contacts on the Third-Party Social Media Service may see Your name, profile, pictures and description of Your activity. Similarly, other users will be able to view descriptions of Your activity, communicate with You and view Your profile.
pl: <strong>Z innymi użytkownikami:</strong> kiedy udostępniasz dane osobowe lub w inny sposób wchodzisz w interakcję w obszarach publicznych z innymi użytkownikami, takie informacje mogą być widoczne dla wszystkich użytkowników i mogą być publicznie rozpowszechniane na zewnątrz. Jeśli wchodzisz w interakcje z innymi użytkownikami lub rejestrujesz się za pośrednictwem zewnętrznej usługi mediów społecznościowych, Twoje kontakty w tej usłudze mogą zobaczyć Twoje imię, profil, zdjęcia i opis Twojej aktywności. Podobnie inni użytkownicy będą mogli zobaczyć opisy Twojej aktywności, komunikować się z Tobą i przeglądać Twój profil.

# privacy-policy.shareWithConsent
source: <strong>With Your consent</strong>: We may disclose Your personal information for any other purpose with Your consent.
pl: <strong>Za Twoją zgodą</strong>: Możemy ujawnić Twoje dane osobowe w dowolnym innym celu za Twoją zgodą.

# privacy-policy.retentionOfPersonalData
source: Retention of Your Personal Data
pl: Przechowywanie Twoich danych osobowych

# privacy-policy.retentionDescription
source: The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.
pl: Firma będzie przechowywać Twoje dane osobowe tylko tak długo, jak będzie to konieczne do celów określonych w niniejszej Polityce Prywatności. Będziemy przechowywać i wykorzystywać Twoje dane osobowe w zakresie niezbędnym do spełnienia naszych obowiązków prawnych (na przykład, jeśli jesteśmy zobowiązani do przechowywania Twoich danych w celu przestrzegania obowiązujących przepisów prawa), rozstrzygania sporów i egzekwowania naszych umów prawnych oraz polityk.

# privacy-policy.usageDataRetention
source: The Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.
pl: Firma będzie również przechowywać dane użytkowania do celów analizy wewnętrznej. Dane użytkowania są zazwyczaj przechowywane przez krótszy okres czasu, z wyjątkiem sytuacji, gdy dane te są wykorzystywane do wzmocnienia bezpieczeństwa lub poprawy funkcjonalności naszej Usługi, lub jesteśmy prawnie zobowiązani do przechowywania tych danych przez dłuższe okresy.

# privacy-policy.transferOfPersonalData
source: Transfer of Your Personal Data
pl: Przekazywanie Twoich danych osobowych

# privacy-policy.transferDescription
source: Your information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.
pl: Twoje informacje, w tym dane osobowe, są przetwarzane w biurach operacyjnych firmy oraz w innych miejscach, gdzie znajdują się strony zaangażowane w przetwarzanie. Oznacza to, że te informacje mogą być przekazywane i przechowywane na komputerach znajdujących się poza Twoim stanem, prowincją, krajem lub inną jurysdykcją rządową, gdzie przepisy ochrony danych mogą różnić się od tych obowiązujących w Twojej jurysdykcji.

# privacy-policy.consentForTransfer
source: Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.
pl: Twoja zgoda na tę Politykę Prywatności, a następnie przesłanie takich informacji, oznacza Twoją zgodę na ten transfer.

# privacy-policy.dataTransferSecurity
source: The Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.
pl: Firma podejmie wszelkie kroki uzasadnione koniecznością, aby zapewnić, że Twoje dane są traktowane bezpiecznie i zgodnie z niniejszą Polityką Prywatności, i żaden transfer Twoich danych osobowych nie będzie miał miejsca do organizacji lub kraju, chyba że istnieją odpowiednie zabezpieczenia, w tym bezpieczeństwo Twoich danych i innych informacji osobowych.

# privacy-policy.deletePersonalData
source: Delete Your Personal Data
pl: Usuń swoje dane osobowe

# privacy-policy.deleteDescription
source: You have the right to delete or request that We assist in deleting the Personal Data that We have collected about You.
pl: Masz prawo do usunięcia lub żądania pomocy w usunięciu Danych Osobowych, które zebraliśmy na Twój temat.

# privacy-policy.deleteServiceAbility
source: Our Service may give You the ability to delete certain information about You from within the Service.
pl: Nasza Usługa może dać Ci możliwość usunięcia pewnych informacji o Tobie z poziomu Usługi.

# privacy-policy.updateAmendDelete
source: You may update, amend, or delete Your information at any time by signing in to Your Account, if you have one, and visiting the account settings section that allows you to manage Your personal information. You may also contact Us to request access to, correct, or delete any personal information that You have provided to Us.
pl: Możesz aktualizować, zmieniać lub usuwać swoje informacje w dowolnym momencie, logując się do swojego konta, jeśli je posiadasz, i odwiedzając sekcję ustawień konta, która umożliwia zarządzanie danymi osobowymi. Możesz również skontaktować się z Nami, aby poprosić o dostęp do, poprawienie lub usunięcie wszelkich danych osobowych, które Nam przekazałeś.

# privacy-policy.retentionLegalObligation
source: Please note, however, that We may need to retain certain information when we have a legal obligation or lawful basis to do so.
pl: Należy jednak pamiętać, że możemy potrzebować zachować pewne informacje, gdy mamy do tego prawny obowiązek lub podstawę prawną.

# privacy-policy.disclosurePersonalData
source: Disclosure of Your Personal Data
pl: Ujawnienie Twoich danych osobowych

# privacy-policy.businessTransactions
source: Business Transactions
pl: Transakcje biznesowe

# privacy-policy.businessTransactionsDescription
source: If the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy.
pl: W przypadku fuzji, przejęcia lub sprzedaży aktywów przez firmę, Twoje dane osobowe mogą zostać przekazane. Poinformujemy Cię, zanim Twoje dane osobowe zostaną przekazane i będą podlegać innej Polityce Prywatności.

# privacy-policy.lawEnforcement
source: Law enforcement
pl: Organy ścigania

# privacy-policy.lawEnforcementDescription
source: Under certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).
pl: W pewnych okolicznościach firma może być zobowiązana do ujawnienia Twoich danych osobowych, jeśli jest to wymagane przez prawo lub w odpowiedzi na ważne żądania organów publicznych (np. sądu lub agencji rządowej).

# privacy-policy.otherLegalRequirements
source: Other legal requirements
pl: Inne wymogi prawne

# privacy-policy.otherLegalRequirementsDescription
source: The Company may disclose Your Personal Data in the good faith belief that such action is necessary to:
pl: Firma może ujawnić Twoje dane osobowe w dobrej wierze, uznając, że taka czynność jest konieczna do:

# privacy-policy.complyLegalObligation
source: Comply with a legal obligation
pl: Wypełnienia obowiązku prawnego

# privacy-policy.protectRightsProperty
source: Protect and defend the rights or property of the Company
pl: Ochrony i obrony praw lub własności firmy

# privacy-policy.preventWrongdoing
source: Prevent or investigate possible wrongdoing in connection with the Service
pl: Zapobiegania lub badania ewentualnych wykroczeń związanych z usługą

# privacy-policy.protectPersonalSafety
source: Protect the personal safety of Users of the Service or the public
pl: Ochrony osobistego bezpieczeństwa użytkowników usługi lub społeczeństwa

# privacy-policy.protectAgainstLiability
source: Protect against legal liability
pl: Ochrony przed odpowiedzialnością prawną

# privacy-policy.securityPersonalData
source: Security of Your Personal Data
pl: Bezpieczeństwo Twoich danych osobowych

# privacy-policy.securityDescription
source: The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.
pl: Bezpieczeństwo Twoich danych osobowych jest dla nas ważne, ale pamiętaj, że żadna metoda transmisji przez Internet ani metoda przechowywania elektronicznego nie jest w 100% bezpieczna. Choć staramy się stosować komercyjnie akceptowane środki do ochrony Twoich danych osobowych, nie możemy zagwarantować ich całkowitego bezpieczeństwa.

# privacy-policy.childrensPrivacy
source: Children's Privacy
pl: Prywatność dzieci

# privacy-policy.childrenPrivacyDescription
source: Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.
pl: Nasza Usługa nie jest przeznaczona dla osób poniżej 13 roku życia. Nie zbieramy świadomie danych osobowych od osób poniżej 13 roku życia. Jeśli jesteś rodzicem lub opiekunem i zdajesz sobie sprawę, że Twoje dziecko przekazało nam dane osobowe, prosimy o kontakt z Nami. Jeśli stwierdzimy, że zebraliśmy dane osobowe od osoby poniżej 13 roku życia bez weryfikacji zgody rodziców, podejmiemy kroki w celu usunięcia tych informacji z naszych serwerów.

# privacy-policy.parentalConsent
source: If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.
pl: Jeśli musimy polegać na zgodzie jako podstawie prawnej przetwarzania Twoich informacji, a Twoje państwo wymaga zgody rodzica, możemy wymagać zgody Twojego rodzica przed zebraniem i wykorzystaniem tych informacji.

# privacy-policy.linksToOtherWebsites
source: Links to Other Websites
pl: Linki do innych stron internetowych

# privacy-policy.linksToOtherWebsitesDescription
source: Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.
pl: Nasza Usługa może zawierać linki do innych stron internetowych, które nie są przez Nas obsługiwane. Jeśli klikniesz link strony trzeciej, zostaniesz przekierowany na stronę tej strony trzeciej. Zalecamy dokładne zapoznanie się z Polityką Prywatności każdej odwiedzanej strony.

# privacy-policy.noControlOverContent
source: We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.
pl: Nie mamy kontroli ani nie ponosimy odpowiedzialności za treści, polityki prywatności ani praktyki jakichkolwiek stron trzecich lub usług.

# privacy-policy.changesToPrivacyPolicy
source: Changes to this Privacy Policy
pl: Zmiany w niniejszej Polityce Prywatności

# privacy-policy.changesToPrivacyPolicyDescription
source: We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.
pl: Możemy aktualizować naszą Politykę Prywatności od czasu do czasu. Powiadomimy Cię o wszelkich zmianach, publikując nową Politykę Prywatności na tej stronie.

# privacy-policy.notifyChanges
source: We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the "Last updated" date at the top of this Privacy Policy.
pl: Poinformujemy Cię za pośrednictwem e-maila i/lub wyraźnego powiadomienia w Naszej Usłudze, przed wejściem zmiany w życie i zaktualizujemy datę "Ostatnia aktualizacja" na górze niniejszej Polityki Prywatności.

# privacy-policy.reviewPrivacyPolicy
source: You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.
pl: Zaleca się okresowe przeglądanie niniejszej Polityki Prywatności pod kątem wszelkich zmian. Zmiany w niniejszej Polityce Prywatności są skuteczne, gdy zostaną opublikowane na tej stronie.

# privacy-policy.contactUs
source: Contact Us
pl: Skontaktuj się z nami

# privacy-policy.contactUsDescription
source: If you have any questions about this Privacy Policy, You can contact us:
pl: Jeśli masz jakiekolwiek pytania dotyczące niniejszej Polityki Prywatności, możesz się z nami skontaktować:

# privacy-policy.contactEmail
source: By email: {{ supportEmail }}
pl: Poprzez email: {{ supportEmail }}

# register.If-you-already-have-account-log-in-instead
source: If you already have account <a [routerLink]="['/login']" routerLinkActive="active">log in</a> instead
pl: Jeśli masz już konto <a [routerLink]="['/login']" routerLinkActive="active">zaloguj się</a>

# stock.Back to coins list
source: Back to coins list
pl: Powrót do listy monet

# stock-order-buy.Current-price
source: Current {{ selectedCrypto.currency_name }} price: {{ cryptoDetails.market_data.current_price | number:'1.2-2' }} {{ selectedFiatWallet.currency }}
pl: Aktualny kurs: {{ price | number:'1.2-2' }} {{ selectedWallet?.currency }}

# stock-order-buy.Amount:Amount
source: Amount
pl: Kwota

# stock-order-buy.Exceeded-free-wallet-funds
source: Exceeded free wallet funds
pl: Przekroczono wolne środki w portfelu

# stock-order-buy.Fiat-Wallet:Fiat wallet
source: Fiat wallet
pl: Portfel fiat

# stock-order-buy.Nominal:Nominal
source: Nominal
pl: Nominał (ilość)

# stock-order-buy.Crypto:Crypto
source: Crypto
pl: Kryptowaluta

# stock-order-buy.Specific-price:Specific price
source: Specific price
pl: Cena szczegółowa

# stock-order-buy.Cancel
source: Cancel
pl: Anuluj

# stock-order-buy.Confirm-order
source: Confirm order
pl: Potwierdź zlecenie

source: You can not create an order<br/>because you do not have any wallets.<br/>Create one and then trade.<br/>You will be redirected to your profile<br/>where you can specify a new wallet
pl: Nie możesz utworzyć zlecenia<br/>ponieważ nie masz żadnych portfeli.<br/>Utwórz jeden i następnie handluj.<br/>Zostaniesz przekierowany do swojego profilu<br/>gdzie możesz dodać nowy portfel

# stock-order-buy.Caution
source: Caution!
pl: Uwaga!

# stock-order-buy.Success
source: Success
pl: Sukces

# stock-order-buy.Order-created-successfully
source: Order created successfully
pl: zlecenie utworzono pomyślnie

# stock-order-buy-config.UNDEFINED
source: UNDEFINED
pl: NIEOKREŚLONE

# stock.model.Instant
source: Instant
pl: Natychmiastowe

# stock.model.Buy-at-the-current-market-price
source: Buy at the current market price
pl: Kup po aktualnej cenie rynkowej

# stock.model.Pending
source: Pending
pl: Oczekujący

# stock.model.Buy-if-it-rises-or-falls-to-specific-price
source: Buy if it rises or falls to specific price
pl: Kup, jeśli wzrośnie lub spadnie do określonej ceny

# stock.model.Sell-at-the-current-market-price
source: Sell at the current market price
pl: Sprzedaj po aktualnej cenie rynkowej

# stock.model.Take-profit
source: Take profit
pl: Zrealizuj zysk

# stock.model.Sell-if-it-rises-to-higher-price
source: Sell if it rises to higher price
pl: Sprzedaj, jeśli wzrośnie do podanej ceny

# stock.model.Stop-loss
source: Stop loss
pl: Zatrzymaj stratę

# stock.model.Sell-if-it-falls-to-lower-price
source: Sell if it falls to lower price
pl: Sprzedaj, jeśli spadnie do niższej ceny

# stock-order-buy.Buy-order
source: Buy order
pl: Zlecenie kupna

# stock-order-buy.Sell-order
source: Sell order
pl: Zlecenie sprzedaży

# stock-order-sell.Sell-order
source: Sell order
pl: Zlecenie sprzedaży

# stock-order-sell.Current-price
source: Current {{ selectedCryptoWallet.currency }} price: {{ cryptoDetails.market_data.current_price | number:'1.2-2' }} {{ selectedFiatWallet.currency }}
pl: Aktualna cena {{ selectedCryptoWallet.currency }}: {{ cryptoDetails.market_data.current_price | number:'1.2-2' }} {{ selectedFiatWallet.currency }}

# stock-order-sell.Nominal:Nominal
source: Nominal
pl: Nominał
