Repository: THD-C/Frontend
Catalog: src/locales/messages.*.xlf
Languages: pl

# app.routes.register.title
source: Increase financial knowledge and develop crypto currencies (sentiments) investment skills with THD(C) | THD(C)
pl: Zwiększ wiedzę finansową i rozwijaj umiejętności inwestowania w kryptowaluty (sentymenty) dzięki THD(C) | THD(C)

# app.routes.login.title
source: Log in to THD(C) | THD(C)
pl: Zaloguj się do świata THD(C) | THD(C)

# app.routes.home.title
source: Welcome to the THD(C) the world's best online tool for training cryptocurrencies trading | THD(C)
pl: Witamy w THD(C), najlepszym na świecie narzędziu online do szkolenia handlu kryptowalutami | THD(C)

# app.routes.profile.title
source: Account details | THD(C)
pl: Szczegóły konta | THD(C)

# app.routes.stock.title
source: Explore the stock market, buy or sell crypto | THD(C)
pl: Odkrywaj rynek kryptowalut, kupuj i sprzedawaj | THD(C)

# app.routes.privacy.policy.title
source: Privacy policy | THD(C)
pl: Polityka prywatności THD(C)

# app.routes.payment.title
source: Payment status | THD(C)
pl: Status płatności | THD(C)

# app.routes.admin.title
source: Admin panel | THD(C)
pl: Panel administracyjny | THD(C)

# app.routes.blog.title
source: Blog - read crypto based articles & expand knowledge | THD(C)
pl: Blog - czytaj artykuły oparte na kryptowalutach i poszerzaj wiedzę | THD(C)

# login.Welcome-back
source: Welcome back!
pl: Witaj ponownie!

# login.Dont-have-account
source: Don't have account? <a [routerLink]="['/register']" routerLinkActive="active">Register</a>
pl: Nie masz konta? <a [routerLink]="['/register']" routerLinkActive="active">Zarejestruj się</a>

# payment-fail.Payment-completed-successfully
source: Payment <span class="fw-bold text-danger text-decoration-underline">failed</span> :(
pl: Płatność <span class="fw-bold text-danger text-decoration-underline">nie powiodła się</span> :(

# payment-fail.Please-try-again-later
source: Please try again later
pl: Proszę spróbować później

# payment-fail.Check-stock
source: Check stock
pl: Przejdź do giełdy

# payment-success.Payment-completed-successfully
source: Payment completed <span class="fw-bold text-success text-decoration-underline">successfully</span>!
pl: Płatność zakończona <span class="fw-bold text-success text-decoration-underline">pomyślnie</span>!

# payment-success.Thank-you-3
source: Thank <span class="text-primary fw-bold">you</span> <3
pl: Dziękuję <span class="text-primary fw-bold">Tobie</span> <3

# payment-success.Check-stock
source: Check stock
pl: Sprawdź dostępność

# privacy-policy.privacyPolicyTitle
source: Privacy Policy
pl: Polityka Prywatności

# privacy-policy.lastUpdated
source: Last updated: December 17, 2024
pl: Ostatnia aktualizacja: 17 grudnia 2024

# privacy-policy.privacyPolicyDescription
source: This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.
pl: Niniejsza Polityka prywatności opisuje nasze zasady i procedury dotyczące zbierania, wykorzystywania i ujawniania Twoich informacji, gdy korzystasz z Usługi, oraz informuje Cię o Twoich prawach w zakresie prywatności i o tym, jak prawo chroni Twoje dane.

# privacy-policy.usageAgreement
source: We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the <a href="https://www.freeprivacypolicy.com/free-privacy-policy-generator/" target="_blank" rel="external nofollow noopener">Free Privacy Policy Generator</a>.
pl: Używamy Twoich danych osobowych, aby zapewnić i ulepszyć Usługę. Korzystając z Usługi, zgadzasz się na zbieranie i wykorzystywanie informacji zgodnie z niniejszą Polityką prywatności. Ta Polityka prywatności została utworzona za pomocą <a href="https://www.freeprivacypolicy.com/free-privacy-policy-generator/" target="_blank" rel="external nofollow noopener">Generatora bezpłatnych polityk prywatności</a>.

# privacy-policy.interpretationDefinitions
source: Interpretation and Definitions
pl: Interpretacja i definicje

# privacy-policy.interpretation
source: Interpretation
pl: Interpretacja

# privacy-policy.interpretationText
source: The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.
pl: Słowa, których pierwsza litera jest wielka, mają znaczenia określone w poniższych warunkach. Poniższe definicje mają to samo znaczenie niezależnie od tego, czy występują w liczbie pojedynczej, czy mnogiej.

# privacy-policy.definitions
source: Definitions
pl: Definicje

# privacy-policy.definitionsText
source: For the purposes of this Privacy Policy:
pl: Na potrzeby niniejszej Polityki prywatności:

# privacy-policy.accountDefinition
source: <strong>Account</strong> means a unique account created for You to access our Service or parts of our Service.
pl: <strong>Konto</strong> oznacza unikalne konto utworzone dla Ciebie, aby uzyskać dostęp do naszej Usługi lub jej części.

# privacy-policy.affiliateDefinition
source: <strong>Affiliate</strong> means an entity that controls, is controlled by or is under common control with a party, where "control" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.
pl: <strong>Podmiot powiązany</strong> oznacza jednostkę, która kontroluje, jest kontrolowana przez lub jest pod wspólną kontrolą z inną stroną, gdzie "kontrola" oznacza posiadanie 50% lub więcej akcji, udziałów własnościowych lub innych papierów wartościowych uprawniających do głosowania przy wyborze dyrektorów lub innych organów zarządzających.

# privacy-policy.companyDefinition
source: <strong>Company</strong> (referred to as either "the Company", "We", "Us" or "Our" in this Agreement) refers to {{ appName }}.
pl: <strong>Firma</strong> (określana jako "Firma", "My", "Nas" lub "Nasz" w niniejszej Umowie) odnosi się do {{ appName }}.

# privacy-policy.cookiesDefinition
source: <strong>Cookies</strong> are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.
pl: <strong>Pliki cookie</strong> to małe pliki umieszczane na Twoim komputerze, urządzeniu mobilnym lub innym urządzeniu przez stronę internetową, zawierające szczegóły Twojej historii przeglądania na tej stronie internetowej, wśród innych zastosowań.

# privacy-policy.countryDefinition
source: <strong>Country</strong> refers to: Poland
pl: <strong>Kraj</strong> odnosi się do: Polska

# privacy-policy.deviceDefinition
source: <strong>Device</strong> means any device that can access the Service such as a computer, a cellphone or a digital tablet.
pl: <strong>Urządzenie</strong> oznacza każde urządzenie, które może uzyskać dostęp do Usługi, takie jak komputer, telefon komórkowy lub tablet cyfrowy.

# privacy-policy.personalDataDefinition
source: <strong>Personal Data</strong> is any information that relates to an identified or identifiable individual.
pl: <strong>Dane osobowe</strong> to wszelkie informacje dotyczące zidentyfikowanej lub możliwej do zidentyfikowania osoby.

# privacy-policy.serviceDefinition
source: <strong>Service</strong> refers to the Website.
pl: <strong>Usługa</strong> odnosi się do Strony internetowej.

# privacy-policy.serviceProviderDefinition
source: <strong>Service Provider</strong> means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.
pl: <strong>Dostawca Usług</strong> oznacza każdą osobę fizyczną lub prawną, która przetwarza dane w imieniu Firmy. Odnosi się to do firm trzecich lub osób zatrudnionych przez Firmę w celu ułatwienia świadczenia Usługi, świadczenia Usługi w imieniu Firmy, wykonywania usług związanych z Usługą lub wspomagania Firmy w analizie, jak Usługa jest wykorzystywana.

# privacy-policy.socialMediaServiceDefinition
source: <strong>Third-party Social Media Service</strong> refers to any website or any social network website through which a User can log in or create an account to use the Service.
pl: <strong>Usługi mediów społecznościowych stron trzecich</strong> odnosi się do każdej strony internetowej lub strony sieci społecznościowej, poprzez którą Użytkownik może zalogować się lub utworzyć konto w celu korzystania z Usługi.

# privacy-policy.usageDataDefinition
source: <strong>Usage Data</strong> refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).
pl: <strong>Dane użytkowe</strong> oznaczają dane zbierane automatycznie, albo wygenerowane podczas korzystania z Usługi, albo z samej infrastruktury Usługi (na przykład czas trwania wizyty na stronie).

# privacy-policy.websiteDefinition
source: <strong>Website</strong> refers to {{ appName }}, accessible from <a href="http://thdc.tail8ec47f.ts.net/" rel="external nofollow noopener" target="_blank">http://thdc.tail8ec47f.ts.net/</a>
pl: <strong>Strona internetowa</strong> odnosi się do {{ appName }}, dostępna pod adresem <a href="http://thdc.tail8ec47f.ts.net/" rel="external nofollow noopener" target="_blank">http://thdc.tail8ec47f.ts.net/</a>

# privacy-policy.youDefinition
source: <strong>You</strong> means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.
pl: <strong>Ty</strong> oznacza osobę uzyskującą dostęp lub korzystającą z Usługi, albo firmę, albo inną jednostkę prawną, w imieniu której taka osoba uzyskuje dostęp lub korzysta z Usługi, w zależności od przypadku.

# privacy-policy.collectingData
source: Collecting and Using Your Personal Data
pl: Zbieranie i wykorzystywanie Twoich danych osobowych

# privacy-policy.typesOfData
source: Types of Data Collected
pl: Rodzaje zbieranych danych

# privacy-policy.personalData
source: Personal Data
pl: Dane osobowe

# privacy-policy.personalDataDescription
source: While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:
pl: Podczas korzystania z naszej Usługi możemy poprosić Cię o podanie nam pewnych danych osobowych, które mogą być użyte do kontaktu z Tobą lub identyfikacji Ciebie. Dane osobowe mogą obejmować, ale nie ograniczają się do:

# privacy-policy.emailAddress
source: Email address
pl: Adres e-mail

# privacy-policy.firstNameLastName
source: First name and last name
pl: Imię i nazwisko

# privacy-policy.phoneNumber
source: Phone number
pl: Numer telefonu

# privacy-policy.address
source: Address, State, Province, ZIP/Postal code, City
pl: Adres, województwo, kod pocztowy, miasto

# privacy-policy.usageDataItem
source: Usage Data
pl: Dane użytkowe

# privacy-policy.usageDataTitle
source: Usage Data
pl: Dane użytkowe

# privacy-policy.usageDataDescription
source: Usage Data is collected automatically when using the Service.
pl: Dane użytkowe są zbierane automatycznie podczas korzystania z Usługi.

# privacy-policy.usageDataDetails
source: Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.
pl: Dane użytkowe mogą zawierać informacje takie jak adres protokołu internetowego Twojego urządzenia (np. adres IP), typ przeglądarki, wersja przeglądarki, strony naszej Usługi, które odwiedzasz, czas i data Twojej wizyty, czas spędzony na tych stronach, unikalne identyfikatory urządzeń i inne dane diagnostyczne.

# privacy-policy.mobileUsageData
source: When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.
pl: Gdy uzyskujesz dostęp do Usługi za pomocą urządzenia mobilnego, możemy automatycznie zbierać pewne informacje, w tym między innymi typ używanego urządzenia mobilnego, unikalny identyfikator Twojego urządzenia mobilnego, adres IP Twojego urządzenia mobilnego, system operacyjny Twojego urządzenia mobilnego, typ mobilnej przeglądarki internetowej, unikalne identyfikatory urządzenia i inne dane diagnostyczne.

# privacy-policy.browserUsageData
source: We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.
pl: Możemy również zbierać informacje wysyłane przez Twoją przeglądarkę za każdym razem, gdy odwiedzasz naszą Usługę lub uzyskujesz dostęp do Usługi za pomocą urządzenia mobilnego.

# privacy-policy.thirdPartyData
source: Information from Third-Party Social Media Services
pl: Informacje z serwisów społecznościowych stron trzecich

# privacy-policy.socialMediaDescription
source: The Company allows You to create an account and log in to use the Service through the following Third-party Social Media Services:
pl: Firma umożliwia Ci utworzenie konta i logowanie się w celu korzystania z Usługi za pośrednictwem następujących zewnętrznych usług mediów społecznościowych:

# privacy-policy.socialMediaData
source: If You decide to register through or otherwise grant us access to a Third-Party Social Media Service, We may collect Personal data that is already associated with Your Third-Party Social Media Service's account, such as Your name, Your email address, Your activities or Your contact list associated with that account.
pl: Jeśli zdecydujesz się zarejestrować lub w inny sposób udzielić nam dostępu do Usługi Mediów Społecznościowych Strony Trzeciej, możemy zbierać dane osobowe, które są już powiązane z Twoim kontem w tej usłudze, takie jak Twoje imię i nazwisko, adres e-mail, Twoje działania lub lista kontaktów powiązane z tym kontem.

# privacy-policy.additionalSocialMediaData
source: You may also have the option of sharing additional information with the Company through Your Third-Party Social Media Service's account. If You choose to provide such information and Personal Data, during registration or otherwise, You are giving the Company permission to use, share, and store it in a manner consistent with this Privacy Policy.
pl: Możesz również mieć możliwość udostępnienia Firmie dodatkowych informacji za pośrednictwem konta w Usłudze Mediów Społecznościowych Strony Trzeciej. Jeśli zdecydujesz się na podanie takich informacji i danych osobowych, podczas rejestracji lub w inny sposób, udzielasz Firmie zgody na ich użycie, udostępnianie i przechowywanie w sposób zgodny z niniejszą Polityką Prywatności.

# privacy-policy.trackingCookies
source: Tracking Technologies and Cookies
pl: Technologie śledzenia i pliki cookie

# privacy-policy.cookieDescription
source: We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:
pl: Używamy plików cookie i podobnych technologii śledzenia do śledzenia aktywności w naszej usłudze i przechowywania określonych informacji. Technologie śledzenia używane to sygnalizatory, tagi i skrypty do zbierania i śledzenia informacji oraz poprawy i analizy naszej usługi. Technologie, których używamy, mogą obejmować:

# privacy-policy.cookiesBrowserCookies
source: <strong>Cookies or Browser Cookies.</strong> A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.
pl: <strong>Pliki cookie lub pliki cookie przeglądarki.</strong> Plik cookie to mały plik umieszczony na Twoim urządzeniu. Możesz nakazać swojej przeglądarce odrzucenie wszystkich plików cookie lub wskazanie, kiedy plik cookie jest wysyłany. Jednakże, jeśli nie zaakceptujesz plików cookie, możesz nie być w stanie korzystać z niektórych części naszej usługi. O ile nie dostosowałeś ustawień przeglądarki tak, aby odrzucała pliki cookie, nasza usługa może używać plików cookie.

# privacy-policy.webBeacons
source: <strong>Web Beacons.</strong> Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).
pl: <strong>Sygnalizatory sieciowe.</strong> Niektóre sekcje naszej usługi i nasze e-maile mogą zawierać małe pliki elektroniczne, znane jako sygnalizatory sieciowe (znane również jako przejrzyste gify, tagi pikseli i jedno-pikselowe gify), które umożliwiają Firmie, na przykład, liczenie użytkowników, którzy odwiedzili te strony lub otworzyli e-mail, oraz zbieranie statystyk dotyczących strony internetowej (na przykład rejestrowanie popularności danej sekcji i weryfikowanie integralności systemu i serwera).

# privacy-policy.cookiesTypesDescription
source: Cookies can be "Persistent" or "Session" Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies on the <a href="https://www.freeprivacypolicy.com/blog/sample-privacy-policy-template/#Use_Of_Cookies_And_Tracking" target="_blank" rel="external nofollow noopener">Free Privacy Policy website</a> article.
pl: Pliki cookie mogą być "trwałe" lub "sesyjne". Trwałe pliki cookie pozostają na Twoim komputerze osobistym lub urządzeniu mobilnym, gdy jesteś offline, podczas gdy pliki cookie sesji są usuwane, gdy tylko zamkniesz przeglądarkę internetową. Dowiedz się więcej o plikach cookie na stronie artykułu <a href="https://www.freeprivacypolicy.com/blog/sample-privacy-policy-template/#Use_Of_Cookies_And_Tracking" target="_blank" rel="external nofollow noopener">Bezpłatna polityka prywatności</a>.

# privacy-policy.sessionPersistentCookies
source: We use both Session and Persistent Cookies for the purposes set out below:
pl: Używamy zarówno sesyjnych, jak i trwałych plików cookie w celach określonych poniżej:

# privacy-policy.necessaryEssentialCookiesTitle
source: <strong>Necessary / Essential Cookies</strong>
pl: <strong>Niezbędne / podstawowe pliki cookie</strong>

# privacy-policy.necessaryEssentialCookiesType
source: Type: Session Cookies
pl: Rodzaj: pliki cookie sesji

# privacy-policy.necessaryEssentialCookiesAdministeredBy
source: Administered by: Us
pl: Administrowane przez: Nas

# privacy-policy.necessaryEssentialCookiesPurpose
source: Purpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.
pl: Cel: Te pliki cookie są niezbędne do świadczenia usług dostępnych przez Stronę internetową i umożliwiają korzystanie z niektórych jej funkcji. Pomagają uwierzytelniać użytkowników i zapobiegać oszustwom związanym z kontami użytkowników. Bez tych plików cookie, usługi, o które prosisz, nie mogą być świadczone, i używamy tych plików cookie wyłącznie do świadczenia tych usług.

# privacy-policy.cookiesPolicyNoticeAcceptanceCookiesTitle
source: <strong>Cookies Policy / Notice Acceptance Cookies</strong>
pl: <strong>Polityka plików cookie / Pliki cookie akceptacji powiadomienia</strong>

# privacy-policy.cookiesPolicyNoticeAcceptanceCookiesType
source: Type: Persistent Cookies
pl: Rodzaj: trwałe pliki cookie

# privacy-policy.cookiesPolicyNoticeAcceptanceCookiesAdministeredBy
source: Administered by: Us
pl: Administrowane przez: Nas

# privacy-policy.cookiesPolicyNoticeAcceptanceCookiesPurpose
source: Purpose: These Cookies identify if users have accepted the use of cookies on the Website.
pl: Cel: Te pliki cookie identyfikują, czy użytkownicy zaakceptowali użycie plików cookie na Stronie internetowej.

# privacy-policy.functionalityCookiesTitle
source: <strong>Functionality Cookies</strong>
pl: <strong>Funkcjonalne pliki cookie</strong>

# privacy-policy.functionalityCookiesType
source: Type: Persistent Cookies
pl: Rodzaj: trwałe pliki cookie

# privacy-policy.functionalityCookiesAdministeredBy
source: Administered by: Us
pl: Administrowane przez: Nas

# privacy-policy.functionalityCookiesPurpose
source: Purpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.
pl: Cel: Te pliki cookie pozwalają nam zapamiętywać wybory, które dokonujesz podczas korzystania ze Strony internetowej, takie jak zapamiętywanie Twoich danych logowania lub preferencji językowych. Celem tych plików cookie jest zapewnienie Ci bardziej spersonalizowanego doświadczenia i uniknięcie konieczności ponownego wprowadzania swoich preferencji przy każdym korzystaniu ze Strony internetowej.

# privacy-policy.cookiesPolicyMoreInformation
source: For more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy.
pl: Aby uzyskać więcej informacji na temat używanych przez nas plików cookie i Twoich wyborów dotyczących plików cookie, odwiedź naszą Politykę plików cookie lub sekcję Pliki cookie w naszej Polityce prywatności.

# privacy-policy.useOfPersonalData
source: Use of Your Personal Data
pl: Wykorzystanie Twoich danych osobowych

# privacy-policy.useOfPersonalDataDescription
source: The Company may use Personal Data for the following purposes:
pl: Firma może wykorzystywać dane osobowe w następujących celach:

# privacy-policy.provideMaintainService
source: <strong>To provide and maintain our Service</strong>, including to monitor the usage of our Service.
pl: <strong>Aby świadczyć i utrzymywać naszą Usługę</strong>, w tym monitorować korzystanie z naszej Usługi.

# privacy-policy.manageAccount
source: <strong>To manage Your Account:</strong> to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.
pl: <strong>Aby zarządzać Twoim kontem:</strong> aby zarządzać Twoją rejestracją jako użytkownika Usługi. Dane osobowe, które podajesz, mogą dać Ci dostęp do różnych funkcji Usługi, które są dostępne dla Ciebie jako zarejestrowanego użytkownika.
