Repository: THD-C/Frontend
Catalog: src/locales/messages.*.xlf
Languages: pl

# stock-order-buy.Exceeded-available-crypto-wallet-nominal
source: Exceeded available crypto wallet nominal
pl: Przekroczono dostępny nominał portfela kryptowalut

# stock-order-sell.Crypto-wallet:Crypto wallet
source: Crypto wallet
pl: Portfel kryptowalut

# stock-order-sell.Amount:Amount
source: Amount
pl: Kwota

# stock-order-sell.Fiat-wallet:Fiat wallet
source: Fiat wallet
pl: Portfel fiat

# stock-order-sell.Specific-price:Specific price
source: Specific price
pl: Cena szczegółowa

# stock-order-sell.Cancel
source: Cancel
pl: Anuluj

# stock-order-sell.Confirm-order
source: Confirm order
pl: Potwierdź zlecenie

source: You can not create an order<br/>because you do not have any wallets.<br/>Create one and then trade.<br/>You will be redirected to your profile<br/>where you can specify a new wallet
pl: Nie możesz utworzyć zlecenia<br/>ponieważ nie masz żadnych portfeli.<br/>Utwórz jeden i następnie handluj.<br/>Zostaniesz przekierowany do swojego profilu<br/>gdzie możesz dodać nowy portfel

# stock-order-sell.Caution
source: Caution!
pl: Uwaga!

# stock-order-sell.Success
source: Success
pl: Sukces

# stock-order-sell.Order-created-successfully
source: Order created successfully
pl: Zlecenie utworzone pomyślnie

# stocks-list.Action
source: Action
pl: Akcja

# stocks-list.Analyse-coin
source: Analyse coin
pl: Analizuj monetę

# stocks-list.Name
source: Name
pl: Nazwa

# stocks-list.Current-price
source: Current price
pl: Aktualna cena

# stocks-list.Price-change-24h-in-currency
source: Price change 24h in currency
pl: Zmiana ceny w ciągu 24h w walucie

# stocks-list.High-24h
source: High 24h
pl: Najwyższa cena 24h

# stocks-list.Low-24h
source: Low 24h
pl: Najniższa cena 24h

# stocks-list.Total-volume
source: Total volume
pl: Całkowity wolumen

# stocks-list.Display-in-currency
source: Display in currency
pl: Wyświetl w walucie

# stock.Display-stats
source: Display stats
pl: Pokaż statystyki

# stock-order-buy.Chart-type:Chart type
source: Chart type
pl: Typ wykresu

# stock.Refresh
source: Refresh
pl: Odśwież

# stock.Display-in-currency
source: Display in currency
pl: Wyświetl w walucie

# stock.Analyse-crypto
source: Analyse crypto
pl: Analizowana kryptowaluta

# stock.Sell
source: Sell
pl: Sprzedaj

# stock.Buy
source: Buy
pl: Kup

# stock.Orders
source: Orders
pl: Zlecenia

# stock.Created-at
source: Created at: {{ order.date_created | date:'yyyy-MM-dd HH:mm:ss' }}
pl: Utworzono: {{ order.date_created | date:'yyyy-MM-dd HH:mm:ss' }}

# stock.Executed-at
source: Executed at: {{ order.date_executed | date:'yyyy-MM-dd HH:mm:ss' }}
pl: Zrealizowano: {{ order.date_executed | date:'yyyy-MM-dd HH:mm:ss' }}

# stock.Crypto-stats
source: Crypto stats
pl: Statystyki kryptowaluty

# stock.Current-price
source: Current price
pl: Aktualna cena

# stock.Min-in-24h
source: Min in 24h
pl: Min w przeciągu 24 godzin

# stock.Max-in-24h
source: Max in 24h
pl: Maks w przeciągu 24 godzin

# stock.Price-change-in-24h
source: Price change in 24h
pl: Zmiana ceny w przeciągu 24 godzin

# stock.Market-cap
source: Market cap
pl: Kapitalizacja rynkowa

# stock.Total-volume
source: Total volume
pl: Suma obrotu

# stock.Close-fullscreen
source: Close fullscreen
pl: Zamknij tryb pełnoekranowy

# stock.Fullscreen
source: Fullscreen
pl: Tryb pełnoekranowy

# stock-analyse.Are-you-sure-you-want-delete-the-order
source: Are you sure you want delete the order?
pl: Czy na pewno chcesz usunąć zamówienie?

# stock-analyse.Caution
source: Caution!
pl: Uwaga!

# stock-analyse.Order-deleted-successfully
source: Order deleted successfully
pl: Zamówienie zostało pomyślnie usunięte

# stock-analyse.Candlestick
source: Candlestick
pl: Świecowy

# stock-analyse.Spline
source: Spline
pl: Liniowy

# register.Register
source: Register
pl: Zarejestruj się

# register.Try-for-free-now-step-1-of-3
source: Try for <span class="text-decoration-underline text-primary">free</span>!
pl: Wypróbuj <span class="text-decoration-underline">za darmo</span> już teraz!

# register.Username
source: Username
pl: Nazwa użytkownika

# register.Password
source: Password
pl: Hasło

# register.Accept-our-privacy-policy
source: Accept our privacy policy
pl: Zaakceptuj naszą politykę prywatności

source: <span class="fw-bold">Improve</span> trading skills, <span class="fw-bold">explore</span> crypto stocks, expand your knowledge and beyond that!
pl: <span class="fw-bold">Zwiększ</span> umiejętności w handlu kryptowalutami, <span class="fw-bold">eksploruj</span> świat kryptowalut, poszerzaj wiedzę i nie tylko!

# home.Try-for-free_
source: Try for free!
pl: Wypróbuj za darmo!

# home.Try-for-free
source: Try for free
pl: Wypróbuj za darmo!

# home.Check-stock
source: Check stock
pl: Sprawdź rynek

# home.US-dollars
source: US dollars
pl: Dolar amerykański

# home.We-offer-free-tool
source: We offer <span class="text-primary text-decoration-underline"> free</span> tool
pl: Dajemy <span class="text-primary text-decoration-underline"> darmowe</span> narzędzie

# home.You-get-skills
source: You get <span class="text-primary text-uppercase fw-bold">skills</span>
pl: a Ty zwiększasz <span class="text-primary text-uppercase fw-bold">umiejętności</span>

# home.It-s-your-time-to-crash-the-market
source: It's your time to <span class="text-primary">crash</span> the crypto market!
pl: To Twój czas, aby <span class="text-primary">opanować</span> rynek krypto!

# home.Explore-crypto
source: Explore crypto
pl: Odkryj krypto

# home.Join-our-community-ers
source: Join our community of <span class="text-primary">{{ appName }}ers</span>
pl: Dołącz do społeczności <span class="text-primary">{{ appName }}ersów</span>

# home.with-10000-daily-active-users
source: with <span class="text-primary fw-bold">10 000 daily</span> active users
pl: z <span class="text-primary fw-bold">10 000 dziennie</span> aktywnych użytkowników

# home.In-just-1-year-the-community-has-grown-to
source: In just 1 year the community has grown to <span class="text-primary fw-bold">100 000</span> users whereas <span class="text-primary fw-bold">10 000</span> of them uses the app daily.<br/>So... Why don't you try it yourself for free!
pl: W 1 rok do społeczności dołączyło <span class="text-primary fw-bold">100 000</span> użytkowników gdzie <span class="text-primary fw-bold">10 000</span> z nich używają ją codziennie.<br/>Więc... Czemu i Ty nie wypróbujesz tego za darmo!

# home.Join-community
source: Join community
pl: Dołącz do społeczności

# home.Number-of-users
source: Number of users
pl: Liczba użytkowników

# login.E-mail-or-username
source: E-mail or username
pl: E-mail lub nazwa użytkownika

# login.Password
source: Password
pl: Hasło

# login.Log-in
source: Log in
pl: Zaloguj się

# home.Discover-the-market-and-make-a-move
source: Discover the crypto world and make a <span class="text-primary text-decoration-underline">move</span>
pl: Odkryj świat krypto i wykonaj swój pierwszy <span class="text-primary text-decoration-underline">krok</span>

source: Everyday we improve our app so you can educate with ease. We support common cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), Tether (USDT), Solana (SOL), USD Coin (USDC), Dogecoin (DOGE) and many more!
pl: Codziennie ulepszamy naszą aplikację, abyś mógł uczyć się z łatwością. Wspieramy popularne kryptowaluty, takie jak Bitcoin (BTC), Ethereum (ETH), Tether (USDT), Solana (SOL), USD Coin (USDC), Dogecoin (DOGE) i wiele innych!

# home.It-s-your-time-to-show-up
source: It's your time to show up!
pl: To Twój czas, żeby zabłysnąć!

# home.Submit
source: Submit
pl: Wyślij

# home.Common-cryptocurrencies-stock-prices
source: Common cryptocurrencies stock prices
pl: Ceny najpopularniejszych kryptowalut

# profile-details.Identity
source: Identity
pl: Tożsamość

# profile-details.Username
source: Username
pl: Nazwa użytkownika

# profile-details.Personal
source: Personal
pl: Dane personalne

# profile-details.Name
source: Name
pl: Imię

# profile-details.Surname
source: Surname
pl: Nazwisko

# profile-details.Address
source: Address
pl: Adres

# profile-details.Country
source: Country
pl: Kraj

# profile-details.City
source: City
pl: Miasto

# profile-details.Postal-code
source: Postal code
pl: Kod pocztowy

# profile-details.Street
source: Street
pl: Ulica

# profile-details.Building
source: Building
pl: Nr budynku

# profile-details.Save
source: Save
pl: Zapisz

# profile-details.Error
source: Error
pl: Błąd

source: Can not update profile details. Missing data. Check the form and try again
pl: Nie można zaktualizować danych profilu. Niektóre pola są niepoprawne uzupełnione. Sprawdź formularz i spróbuj ponownie

# profile.Details
source: Details
pl: Szczegóły

# profile.Wallets
source: Wallets
pl: Portfele

# auth-errors.E-mail-or-username-already-occupied
source: E-mail or username already occupied
pl: Adres e-mail lub nazwa użytkownika już jest zajęta

# auth-erros.Credentials-are-invalid-Please-try-again-or-create-account
source: Credentials are invalid. Please try again or create account
pl: Dane uwierzytelniające są niepoprawne. Spróbuj ponownie lub utwórz konto

source: Could not authenticate with external provider. Please try again or contact support
pl: Nie udało się z uwierzytelnić z zewnętrznym dostawcą usługi. Spróbuj ponownie lub skontaktuj się z naszym supportem

source: It looks like the password you've entered is very common and could be easily guessed by attackers. For your security, please choose a more unique and complex password that includes a mix of letters, numbers, and special characters
pl: Wprowadzone hasło jest bardzo popularne i może zostać łatwo odgadnięte przez atakujących. Dla własnego bezpieczeństwa wybierz bardziej unikalne i złożone hasło, które zawiera kombinację liter, cyfr i znaków specjalnych

# auth-errors.Password-is-too-short-12-chars-required
source: Password is too short. 12 chars required
pl: Hasło zbyt krótkie. Wymagane 12 znaków

# blogs-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Operacja nieudana. Proszę spróbuj ponownie

# blogs-errors.User-does-not-have-enought-priviliges
source: User does not have enought priviliges
pl: Użytkownik nie ma wystarczających uprawnień

# cryptos-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Operacja nie powiodła się. Spróbuj ponownie

# cryptos-errors.Invalid-data-passed-to-endpoint
source: Invalid data passed to endpoint
pl: Niepoprawne dane przekazane w żądania

# currencies-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Operacja nie powiodła się. Spróbuj ponownie

# orders-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Zlecenie nie powiodło się. Spróbuj ponownie

# orders-errors.Invalid-order-ID
source: Invalid order ID
pl: Nieprawidłowy identyfikator zamówienia

# payments-errors.Currency-not-supported
source: Currency not supported
pl: Waluta nieobsługiwana

# payments-errors.Invalid-nominal
source: Invalid-nominal
pl: Nieprawidłowy nominal

# statistics-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Operacja nie powiodła się. Proszę spróbować ponownie

source: Delete
pl: Usuń

source: Edit
pl: Edytuj

# admin-user-change-type.Update-user-type
source: Update user type
pl: Zaktualizuj typ użytkownika

# admin-user-change-type.User-type
source: User type
pl: Typ użytkownika

# admin-user-change-type.Cancel
source: Cancel
pl: Anuluj

# admin-user-change-type.Change
source: Change
pl: Zmień

# home.Crypto-trading-without-liabilities_
source: Crypto trading <span class="text-primary"><span class="text-decoration-underline">without</span> liabilities</span>!
pl: Handel kryptowalutami <span class="text-primary"><span class="text-decoration-underline">bez</span> zobowiązań</span>!

# payment-wallet-edit.Currency
source: Currency
pl: Waluta

# profile-wallet-create.Cancel
source: Cancel
pl: Anuluj

# profile-wallet-create.Save
source: Save
pl: Zapisz

# profile-wallet-create.New-wallet
source: New wallet
pl: Nowy portfel

# profile-wallets.Are-you-sure-you-want-delete-the-wallet
source: Are you sure you want delete the wallet?
pl: Czy na pewno chcesz usunać portfel?

# profile-wallets.Caution
source: Caution!
pl: Uwaga!

# profile-wallets.Currency
source: Currency
pl: Waluta

# profile-wallets.Is-crypto
source: Is crypto
pl: Jest kryptowalutą

# profile-wallets.Available-nominal
source: Available nominal
pl: Dostępny nominał

# profile-wallets.Action
source: Action
pl: Akcja

# profile.wallets.Add-money
source: Add money
pl: Dodaj fundusze

# profile-wallets.Show-orders
source: Show orders
pl: Pokaż zamówienia

# profile-details.Restore
source: Restore
pl: Przywróć

# notifications.Success
source: Success
pl: Sukces

# admin-user-change-type.User-type-updated-successfully
source: User type updated successfully
pl: Typ użytkownika został pomyślnie zaktualizowany

# admin-users.Action
source: Action
pl: Akcja

# admin-users.Username
source: Username
pl: Nazwa użytkownika

# admin-users.Type
source: Type
pl: Typ

# admin-users.Are-you-sure-you-want-delete-user
source: Are you sure you want delete user?
pl: Czy na pewno chcesz usunąć użytkownika?

# admin-users.Caution
source: Caution!
pl: Uwaga!

# admin.Users
source: Users
pl: Użytkownicy

# blog-post-edit.Written-in
source: Written in
pl: Napisane w

# blog-post-edit.Title
source: Title
pl: Tytuł

# blog-post-edit.Save
source: Save
pl: Zapisz

# blog-post-edit.Blog-post-saved-successfully
source: Blog post saved successfully
pl: Post na blogu został pomyślnie zapisany

# blog-posts.Are-you-sure-you-want-delete-blog-post
source: Are you sure you want delete blog post?
pl: Czy na pewno chcesz usunąć post na blogu?

# blog-posts.Caution
source: Caution!
pl: Uwaga!

# blog-posts.Blog-post-deleted-successfully
source: Blog post deleted successfully
pl: Post na blogu został pomyślnie usunięty

# blog-post-read.Loading
source: Loading...
pl: Ładowanie...

# blog-posts.Language
source: Language
pl: Język

# blog-posts.Title
source: Title
pl: Tytuł

# blog-posts.Filter
source: Filter
pl: Filtruj

# blog-posts.Add
source: Add
pl: Dodaj

# blog-posts.Your-searched-blog-posts-are-not-here-Try-different-filters
source: Your searched blog posts are not here. Try different filters
pl: Twoje wyszukiwane posty na blogu nie są tutaj. Spróbuj innych filtrów

# profile-details.Profile-updated-successfully
source: Profile updated successfully
pl: Dane profilu zapisane pomyślnie

# profile-wallet-create.Wallet-saved-successfully
source: Wallet saved successfully
pl: Portfel zapisany

# profile-wallet-orders.Action
source: Action
pl: Akcje

# profile-wallet-orders.Date-created
source: Date created
pl: Data utworzenia

# profile-wallet-orders.Date-executed
source: Date executed
pl: Data realizacji

# profile-wallet-orders.Nominal
source: Nominal
pl: Nominał (ilość)

# profile-wallet-orders.Price
source: Price
pl: Cena

# profile-wallet-orders.Cash quantity
source: Cash quantity
pl: Ilość gotówki

# profile-wallet-orders.Side
source: Side
pl: Kierunek

# profile-wallet-orders.Fiat wallet
source: Fiat wallet
pl: Portfel fiat

# profile-wallet-orders.Crypto wallet
source: Crypto wallet
pl: Portfel krypto

# profile-wallet-orders.Wallet-orders
source: Wallet orders
pl: Zamówienia portfela

# profile-wallet-orders.wallet-orders
source: wallet orders
pl: zamówienia portfela

# profile-wallet-orders.Are-you-sure-you-want-delete-the-order
source: Are you sure you want delete the order?
pl: Czy na pewno chcesz usunąć zamówienie?

# profile-wallet-orders.Caution
source: Caution!
pl: Uwaga!

# profile-wallet-orders.Order-deleted-successfully
source: Order deleted successfully
pl: Zamówienie zostało pomyślnie usunięte

# profile-wallet-orders.Unknown
source: Unknown
pl: Nieznany

# profile-wallets.Add
source: Add
pl: Dodaj

# profile-wallets.Wallet-deleted-successfully
source: Wallet deleted successfully
pl: Portfel usunięty

# login.or
source: - or -
pl: - lub -

# profile-password.Password
source: Password
pl: Hasło

# profile-password.Old-password
source: Old password
pl: Stare hasło

# profile-password.New-password
source: New password
pl: Nowe hasło

# profile-password.Change
source: Change
pl: Zmień

# profile-password.Error
source: Error
pl: Błąd

source: Can not change password. Missing data. Check the form and try again
pl: Nie można zmienić hasła. Brakuje danych. Uzupełnij formularz i spróbuj ponownie

# profile-password.Password-changed-successfully-Please-login-again
source: Password changed successfully. Please login again
pl: Hasło zmienione poprawnie. Proszę zalogować się ponownie

# profile-payments.Action
source: Action
pl: Akcja

# profile-payments.Cancel
source: Cancel
pl: Anuluj

# profile-payments.Currency
source: Currency
pl: Waluta

# profile-payments.Nominal
source: Nominal
pl: Nominał

# profile-payments.State
source: State
pl: Stan

# profile-payments.Are-you-sure-you-want-cancel-the-payment
source: Are you sure you want cancel the payment?
pl: Czy na pewno chcesz anulować płatność?

# profile-payments.Caution
source: Caution!
pl: Uwaga!

# profile-payments.Payment-canceled-successfully
source: Payment canceled successfully
pl: Płatność anulowana pomyślnie

# profile-statisticts.Display-calculate-in-currency
source: Display/calculate in currency
pl: Wyświetlanie/obliczanie w walucie

# profile-statistics.Portfolio-diversity
source: Portfolio diversity
pl: Dywersyfikacja portfela

# profile-statisticts.Estimated-fiat-value
source: Estimated fiat value
pl: Szacowana wartość w walucie fiducjarnej

# profile-wallet-add-money.Amount_min-1_:Amount (min 1)
source: Amount (min 1)
pl: Kwota (min 1

# profile-wallet-add-money.Cancel
source: Cancel
pl: Anuluj

# profile-wallet-add-money.Add
source: Add
pl: Dodaj

# profile-wallet-add-money.Adding-money-to-wallet
source: Adding money to wallet
pl: Dodawanie funduszy to portfela

# profile-wallet-add-money.Money-added-successfully
source: Money added successfully
pl: Kwota dodana pomyślnie

# profile.Password
source: Password
pl: Hasło

# profile.Payments
source: Payments
pl: Płatności

# profile.Statistics
source: Statistics
pl: Statystyki

# users-errors.Invalid-old-password
source: Invalid old password
pl: Niepoprawne stare hasło

# users-errors.Unauthorized-user-for-method
source: Unauthorized user for method
pl: Nieautoryzowany użytkownik dla metody

# wallets-errors.Operation-failed-Please-try-again
source: Operation failed. Please try again
pl: Operacja nie powiodła się. Spróbuj ponownie

# wallets-errors.Invalid-wallet-id
source: Invalid wallet ID
pl: Niepoprawne ID portfela

# donate.Support-us
source: Support us
pl: Wesprzyj nas

# donate.Donate
source: Donate
pl: Darowizna

# donate.Support-us-via-donate
source: Support us via donate
pl: Wesprzyj nas poprzez darowiznę

# donate.Currency
source: Currency
pl: Waluta

# donate.Nominal_min-1_:Nominal (min 1)
source: Nominal (min 1)
pl: Nominał (min 1)

# donate.Cancel
source: Cancel
pl: Anuluj

# donate.In-order-to-donate-log-in-first
source: In order to donate log in first
pl: Aby przekazać darowiznę, najpierw zaloguj się

# header.Home
source: Home
pl: Strona główna

# header.Stock
source: Stock
pl: Rynek kryptowalut

# header.About
source: About
pl: O nas

# header.Log-in
source: Log in
pl: Zaloguj się

# header.Try-for-free
source: Try for free
pl: Wypróbuj za darmo

# home.Profile
source: Profile
pl: Profil

# header.Profile
source: Profile
pl: Profil

# header.Admin
source: Admin
pl: Administrator

# header.Log-out
source: Log out
pl: Wyloguj sie

# home.Languages
source: Languages
pl: Język aplikacji

# home.Switch-to-light-dark-theme
source: Switch to light/dark theme
pl: Zmień na motyw jasny/ciemny

# password-strength-validator.Password-must-be-at-least-12-characters-long
source: Password must be at least 12 characters long
pl: Hasło musi mieć przynajmniej 12 znaków

# home.Users-growth
source: Users growth
pl: Nowi użytkownicy w czasie

# home.All-Rights-Reserved
source: All Rights Reserved
pl: Wszelkie prawa zastrzeżone

# home.Home
source: Home
pl: Strona główna
